MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV128GM104/mcu.h
#define _C1FMSKSEL2_F9MSK0_POSITION              0x00000002
#define _C1FMSKSEL2_F9MSK0_MASK                  0x00000004
#define _C1FMSKSEL2_F9MSK0_LENGTH                0x00000001

#define _C1FMSKSEL2_F9MSK1_POSITION              0x00000003
#define _C1FMSKSEL2_F9MSK1_MASK                  0x00000008
#define _C1FMSKSEL2_F9MSK1_LENGTH                0x00000001

#define _C1FMSKSEL2_F10MSK0_POSITION             0x00000004
#define _C1FMSKSEL2_F10MSK0_MASK                 0x00000010
#define _C1FMSKSEL2_F10MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F10MSK1_POSITION             0x00000005
#define _C1FMSKSEL2_F10MSK1_MASK                 0x00000020
#define _C1FMSKSEL2_F10MSK1_LENGTH               0x00000001

#define _C1FMSKSEL2_F11MSK0_POSITION             0x00000006
#define _C1FMSKSEL2_F11MSK0_MASK                 0x00000040
#define _C1FMSKSEL2_F11MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F11MSK1_POSITION             0x00000007
#define _C1FMSKSEL2_F11MSK1_MASK                 0x00000080
#define _C1FMSKSEL2_F11MSK1_LENGTH               0x00000001

#define _C1FMSKSEL2_F12MSK0_POSITION             0x00000008
#define _C1FMSKSEL2_F12MSK0_MASK                 0x00000100
#define _C1FMSKSEL2_F12MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F12MSK1_POSITION             0x00000009
#define _C1FMSKSEL2_F12MSK1_MASK                 0x00000200
#define _C1FMSKSEL2_F12MSK1_LENGTH               0x00000001

#define _C1FMSKSEL2_F13MSK0_POSITION             0x0000000A
#define _C1FMSKSEL2_F13MSK0_MASK                 0x00000400
#define _C1FMSKSEL2_F13MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F13MSK1_POSITION             0x0000000B
#define _C1FMSKSEL2_F13MSK1_MASK                 0x00000800
#define _C1FMSKSEL2_F13MSK1_LENGTH               0x00000001

#define _C1FMSKSEL2_F14MSK0_POSITION             0x0000000C
#define _C1FMSKSEL2_F14MSK0_MASK                 0x00001000
#define _C1FMSKSEL2_F14MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F14MSK1_POSITION             0x0000000D
#define _C1FMSKSEL2_F14MSK1_MASK                 0x00002000
#define _C1FMSKSEL2_F14MSK1_LENGTH               0x00000001

#define _C1FMSKSEL2_F15MSK0_POSITION             0x0000000E
#define _C1FMSKSEL2_F15MSK0_MASK                 0x00004000
#define _C1FMSKSEL2_F15MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F15MSK1_POSITION             0x0000000F
#define _C1FMSKSEL2_F15MSK1_MASK                 0x00008000
#define _C1FMSKSEL2_F15MSK1_LENGTH               0x00000001

#define _C1BUFPNT1_F0BP_POSITION                 0x00000000
#define _C1BUFPNT1_F0BP_MASK                     0x0000000F
#define _C1BUFPNT1_F0BP_LENGTH                   0x00000004

#define _C1BUFPNT1_F1BP_POSITION                 0x00000004
#define _C1BUFPNT1_F1BP_MASK                     0x000000F0
#define _C1BUFPNT1_F1BP_LENGTH                   0x00000004

#define _C1BUFPNT1_F2BP_POSITION                 0x00000008
#define _C1BUFPNT1_F2BP_MASK                     0x00000F00
#define _C1BUFPNT1_F2BP_LENGTH                   0x00000004

#define _C1BUFPNT1_F3BP_POSITION                 0x0000000C
#define _C1BUFPNT1_F3BP_MASK                     0x0000F000
#define _C1BUFPNT1_F3BP_LENGTH                   0x00000004

#define _C1BUFPNT1_F0BP0_POSITION                0x00000000
#define _C1BUFPNT1_F0BP0_MASK                    0x00000001
#define _C1BUFPNT1_F0BP0_LENGTH                  0x00000001

#define _C1BUFPNT1_F0BP1_POSITION                0x00000001
#define _C1BUFPNT1_F0BP1_MASK                    0x00000002
#define _C1BUFPNT1_F0BP1_LENGTH                  0x00000001

#define _C1BUFPNT1_F0BP2_POSITION                0x00000002
#define _C1BUFPNT1_F0BP2_MASK                    0x00000004
#define _C1BUFPNT1_F0BP2_LENGTH                  0x00000001

#define _C1BUFPNT1_F0BP3_POSITION                0x00000003
#define _C1BUFPNT1_F0BP3_MASK                    0x00000008
#define _C1BUFPNT1_F0BP3_LENGTH                  0x00000001

#define _C1BUFPNT1_F1BP0_POSITION                0x00000004
#define _C1BUFPNT1_F1BP0_MASK                    0x00000010
#define _C1BUFPNT1_F1BP0_LENGTH                  0x00000001

#define _C1BUFPNT1_F1BP1_POSITION                0x00000005
#define _C1BUFPNT1_F1BP1_MASK                    0x00000020
#define _C1BUFPNT1_F1BP1_LENGTH                  0x00000001

#define _C1BUFPNT1_F1BP2_POSITION                0x00000006
#define _C1BUFPNT1_F1BP2_MASK                    0x00000040
#define _C1BUFPNT1_F1BP2_LENGTH                  0x00000001

#define _C1BUFPNT1_F1BP3_POSITION                0x00000007
#define _C1BUFPNT1_F1BP3_MASK                    0x00000080
#define _C1BUFPNT1_F1BP3_LENGTH                  0x00000001

#define _C1BUFPNT1_F2BP0_POSITION                0x00000008
#define _C1BUFPNT1_F2BP0_MASK                    0x00000100
#define _C1BUFPNT1_F2BP0_LENGTH                  0x00000001

#define _C1BUFPNT1_F2BP1_POSITION                0x00000009
#define _C1BUFPNT1_F2BP1_MASK                    0x00000200
#define _C1BUFPNT1_F2BP1_LENGTH                  0x00000001

#define _C1BUFPNT1_F2BP2_POSITION                0x0000000A
#define _C1BUFPNT1_F2BP2_MASK                    0x00000400
#define _C1BUFPNT1_F2BP2_LENGTH                  0x00000001

#define _C1BUFPNT1_F2BP3_POSITION                0x0000000B
#define _C1BUFPNT1_F2BP3_MASK                    0x00000800
#define _C1BUFPNT1_F2BP3_LENGTH                  0x00000001

#define _C1BUFPNT1_F3BP0_POSITION                0x0000000C
#define _C1BUFPNT1_F3BP0_MASK                    0x00001000
#define _C1BUFPNT1_F3BP0_LENGTH                  0x00000001

#define _C1BUFPNT1_F3BP1_POSITION                0x0000000D
#define _C1BUFPNT1_F3BP1_MASK                    0x00002000
#define _C1BUFPNT1_F3BP1_LENGTH                  0x00000001

#define _C1BUFPNT1_F3BP2_POSITION                0x0000000E
#define _C1BUFPNT1_F3BP2_MASK                    0x00004000
#define _C1BUFPNT1_F3BP2_LENGTH                  0x00000001

#define _C1BUFPNT1_F3BP3_POSITION                0x0000000F
#define _C1BUFPNT1_F3BP3_MASK                    0x00008000
#define _C1BUFPNT1_F3BP3_LENGTH                  0x00000001

#define _C1RXFUL1_RXFUL0_POSITION                0x00000000
#define _C1RXFUL1_RXFUL0_MASK                    0x00000001
#define _C1RXFUL1_RXFUL0_LENGTH                  0x00000001

#define _C1RXFUL1_RXFUL1_POSITION                0x00000001
#define _C1RXFUL1_RXFUL1_MASK                    0x00000002
#define _C1RXFUL1_RXFUL1_LENGTH                  0x00000001

#define _C1RXFUL1_RXFUL2_POSITION                0x00000002
#define _C1RXFUL1_RXFUL2_MASK                    0x00000004
#define _C1RXFUL1_RXFUL2_LENGTH                  0x00000001

#define _C1RXFUL1_RXFUL3_POSITION                0x00000003
#define _C1RXFUL1_RXFUL3_MASK                    0x00000008
#define _C1RXFUL1_RXFUL3_LENGTH                  0x00000001

