MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV128GM104/mcu.h
/* Register FPOR (0x157a4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0x157a4),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown Out Reset Detection Bit:
**     BOREN0_OFF           BOR is Disabled
**     BOREN0_ON            BOR is Enabled
**
*/

#define BOREN0_OFF           0x0000
#define BOREN0_ON            0x0001

/* Register FICD (0x157a8)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0x157a8),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select Bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
*/

#define ICS_NONE             0x0080
#define ICS_PGD3             0x0081
#define ICS_PGD2             0x0082
#define ICS_PGD1             0x0083

/* Register FDMTINTVL (0x157ac)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTINTVL;
#define _FDMTINTVL(x) __attribute__((address(0x157ac),deprecated_definition("consider migrating to #pragma config"),section("__FDMTINTVL.sec"),space(prog))) __prog__ uint16_t _FDMTINTVL = (x);

/*
** Only one invocation of FDMTINTVL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTINTVL.
** Multiple options may be combined, as shown:
**
** _FDMTINTVL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 Bits of 32 Bit DMT Window Interval:
**     DMTIVTL_DMTIVTL      Lower 16 bits of 32 bit DMT window interval (0-0xFFFF)
**
*/

#define DMTIVTL_DMTIVTL      0x0000

/* Register FDMTINTVH (0x157b0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTINTVH;
#define _FDMTINTVH(x) __attribute__((address(0x157b0),deprecated_definition("consider migrating to #pragma config"),section("__FDMTINTVH.sec"),space(prog))) __prog__ uint16_t _FDMTINTVH = (x);

/*
** Only one invocation of FDMTINTVH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTINTVH.
** Multiple options may be combined, as shown:
**
** _FDMTINTVH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 Bits of 32 Bit DMT Window Interval:
**     DMTIVTH_DMTIVTH      Upper 16 bits of 32 bit DMT window interval (0-0xFFFF)
**
*/

#define DMTIVTH_DMTIVTH      0x0000

/* Register FDMTCNTL (0x157b4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTCNTL;
#define _FDMTCNTL(x) __attribute__((address(0x157b4),deprecated_definition("consider migrating to #pragma config"),section("__FDMTCNTL.sec"),space(prog))) __prog__ uint16_t _FDMTCNTL = (x);

/*
** Only one invocation of FDMTCNTL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTL.
** Multiple options may be combined, as shown:
**
** _FDMTCNTL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 Bits of 32 Bit DMT Instruction Count Time-Out Value:
**     DMTCNTL_DMTCNTL      Lower 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF)
**
*/

#define DMTCNTL_DMTCNTL      0x0000

/* Register FDMTCNTH (0x157b8)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTCNTH;
#define _FDMTCNTH(x) __attribute__((address(0x157b8),deprecated_definition("consider migrating to #pragma config"),section("__FDMTCNTH.sec"),space(prog))) __prog__ uint16_t _FDMTCNTH = (x);

/*
** Only one invocation of FDMTCNTH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTH.
** Multiple options may be combined, as shown:
**
** _FDMTCNTH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 Bits of 32 Bit DMT Instruction Count Time-Out Value:
**     DMTCNTH_DMTCNTH      Upper 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF)
**
*/

#define DMTCNTH_DMTCNTH      0x0000

/* Register FDMT (0x157bc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMT;
#define _FDMT(x) __attribute__((address(0x157bc),deprecated_definition("consider migrating to #pragma config"),section("__FDMT.sec"),space(prog))) __prog__ uint16_t _FDMT = (x);

/*
** Only one invocation of FDMT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMT.
** Multiple options may be combined, as shown:
**
** _FDMT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Enable Bit:
**     DMTEN_DISABLE        Dead Man Timer is Disabled and can be enabled by software
**     DMTEN_ENABLE         Dead Man Timer is Enabled and cannot be disabled by software
**
*/

#define DMTEN_DISABLE        0x0000
#define DMTEN_ENABLE         0x0001

/* Register FDEVOPT (0x157c0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT;
#define _FDEVOPT(x) __attribute__((address(0x157c0),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT.sec"),space(prog))) __prog__ uint16_t _FDEVOPT = (x);

